Revit 2018 API
ExternalResourceBrowserData.IsValidResouceName Method
 Checks whether the resource name is valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2015
Syntax
C#
[ObsoleteAttribute("This function is obsolete in Revit 2018. Use IsValidResourceName() instead.")]
public bool IsValidResouceName(
	string resourceName
)
Visual Basic
<ObsoleteAttribute("This function is obsolete in Revit 2018. Use IsValidResourceName() instead.")> _
Public Function IsValidResouceName ( _
	resourceName As String _
) As Boolean
Visual C++
[ObsoleteAttribute(L"This function is obsolete in Revit 2018. Use IsValidResourceName() instead.")]
public:
bool IsValidResouceName(
	String^ resourceName
)
Parameters
resourceName
Type: System.String
 The resource name to check.
Return Value
 True if the name is a valid resource name, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
ExternalResourceBrowserData Class
Autodesk.Revit.DB Namespace